import numpy as np
import pandas as pd

<h1>Filter</h1>

In [5]:
num=np.array([1,2,3,4,5,6,7,8,9,10])
even_number=num[num%2==0]
print("even numbers",even_number)

even numbers [ 2  4  6  8 10]

In [6]:
mask=num>5
print("nums is greater than 5",num[mask])

nums is greater than 5 [ 6  7  8  9 10]

<h1>array compatibility</h1>

In [7]:
a=np.array([1,2,3])
b=np.array([3,4,5,6])
c=np.array([7,8,9])
print("compatibility shapes",a.shape==b.shape)

compatibility shapes False

In [10]:
import pandas as pd
b=pd.DataFrame({
    'days':[1,2,np.NaN,4,5],
    'Places':['puri','maldives','manali','los angles','moscow'],
    'visitors':[0000,8000,9000,10000,6700],
})
b

   days      Places  visitors
0   1.0        puri         0
1   2.0    maldives      8000
2   NaN      manali      9000
3   4.0  los angles     10000
4   5.0      moscow      6700

In [11]:
b.to_csv('friends.csv')

In [13]:
b.to_csv('friends.csv',index=False)

In [14]:
b.to_csv('friends_index_false.csv',index=False)

In [15]:
b.head(2)

   days    Places  visitors
0   1.0      puri         0
1   2.0  maldives      8000

In [16]:
b.tail(2)

   days      Places  visitors
3   4.0  los angles     10000
4   5.0      moscow      6700

In [18]:
b.describe()

           days      visitors
count  4.000000      5.000000
mean   3.000000   6740.000000
std    1.825742   3960.807998
min    1.000000      0.000000
25%    1.750000   6700.000000
50%    3.000000   8000.000000
75%    4.250000   9000.000000
max    5.000000  10000.000000

In [20]:
bigya=pd.read_csv('friends.csv')

In [21]:
bigya

   days      Places  visitors
0   1.0        puri         0
1   2.0    maldives      8000
2   NaN      manali      9000
3   4.0  los angles     10000
4   5.0      moscow      6700

In [22]:
bigya['visitors'][0]=10000

C:\Users\BIGYAJEET\AppData\Local\Temp\ipykernel_23132\4170462295.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bigya['visitors'][0]=10000

In [23]:
bigya

   days      Places  visitors
0   1.0        puri     10000
1   2.0    maldives      8000
2   NaN      manali      9000
3   4.0  los angles     10000
4   5.0      moscow      6700

In [27]:
bigya.to_csv('bigyajeet.csv')

In [31]:
bigya.index=['first','second','third','fourth','fifth']

In [30]:
bigya

   days      Places  visitors
0   1.0        puri     10000
1   2.0    maldives      8000
2   NaN      manali      9000
3   4.0  los angles     10000
4   5.0      moscow      6700